W13D4/todos/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todo = Todo.all

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "40mil"], ["body", "Build a my mansion with 12 rooms and sell it"], ["done", true], ["created_at", "2020-01-24 04:26:14.732395"], ["updated_at", "2020-01-24 04:26:14.732395"]]
---
  def create
    # @todo = Todo.new({ title: params[:title], body: params[:body], done: params[:done]})
    @todo = Todo.new(todo_params)

    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", " 100Billion"], ["updated_at", "2020-01-29 21:10:21.657063"], ["id", 13]]
---
  def update
    @todo = Todo.find(params[:id])

    if @todo.update_attributes(todo_params)